In [2]:
import pandas as pd

#create DataFrame
df = pd.DataFrame({'team': ['A', 'A', 'B', 'B', 'C'],
                   'points': [25, 12, 15, 14, 19],
                   'assists': [5, 7, 7, 9, 12],
                   'rebounds': [11, 8, 10, 6, 6]})

In [3]:
df

  team  points  assists  rebounds
0    A      25        5        11
1    A      12        7         8
2    B      15        7        10
3    B      14        9         6
4    C      19       12         6

In [4]:
df[(df.points > 13) & (df.assists > 7)]

  team  points  assists  rebounds
3    B      14        9         6
4    C      19       12         6

In [6]:
filter_list = [12, 14, 15]

#return only rows where points is in the list of values
df[df.points.isin(filter_list)]

  team  points  assists  rebounds
1    A      12        7         8
2    B      15        7        10
3    B      14        9         6

In [7]:
#define another list of values
filter_list2 = ['A', 'C']

#return only rows where team is in the list of values
df[df.team.isin(filter_list2)]

  team  points  assists  rebounds
0    A      25        5        11
1    A      12        7         8
4    C      19       12         6